{
  "backend/main.mo": "Implements session management, events, scoreboard updates, and flag handling for the backend actor.",
  "backend/migration.mo": "Migrates old session/event data to the new format adding flag overlays and flagEvent fields.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides human-written summaries for many frontend components, hooks, and pages.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light/dark theming across the app.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, broadcast, viewer join, and viewer watch pages using FootballLayout.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Provides broadcaster game controls with a dialog for submitting flag events including team selection and reason.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Displays camera permission or hardware error messages with a retry button.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Provides UI for editing scoreboard scores and icons and sending updates via mutation.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Displays the session code with a copy-to-clipboard button.",
  "frontend/src/components/events/EventFeed.tsx": "Renders a scrollable list of game events with icons and timestamps.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Shows a centered overlay announcing a flag event with team and reason.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Displays a temporary top overlay highlighting the most recent event.",
  "frontend/src/components/layout/FootballLayout.tsx": "Page layout with header, footer, branding, and social links.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty placeholder component file.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Renders an on‑camera bottom scoreboard bar with team icons and scores.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Card wrapper component for scoreboard sections with title and optional icon.",
  "frontend/src/components/system/UnsupportedState.tsx": "Displays a warning card when the browser lacks required broadcasting features.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Shows video container with different states for waiting, live, ended, or unknown sessions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to authentication state and invalidates dependent queries.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session lifecycle including generating codes, starting, and ending sessions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for session validation, session lifecycle actions, and fetching events, metadata, and scoreboard data.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and manages the viewer's session code in React state synced with localStorage.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Computes session lifecycle state (waiting, live, ended, unknown) from metadata and loading state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and custom utilities for scoreboard and broadcast visuals.",
  "frontend/src/lib/teamIcons.ts": "Provides team icon metadata and a helper to lookup icon info by enum value.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/BroadcasterPage.tsx": "UI and logic for broadcasters to start/end sessions, manage camera, control scoreboard, and display live overlays and event feeds.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering navigation to start broadcasting or join a viewing session.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Allows viewers to enter and validate a session code, storing it and navigating to the viewer page on success.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer watch page that loads session data, displays the video player with event/flag/score overlays, and shows an event feed with a leave-session button.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, extended theme colors, container settings, custom animations, and typography/container-query/animate plugins.",
  "project_state.json": "Project metadata describing the live-streaming app’s purpose, architectural notes, known issues, and an enumerated list of existing features."
}