{
  "backend/main.mo": "Actor managing broadcast sessions with scoreboard, events, captions, and lifecycle operations like start, setTeamIcons, and endSession.",
  "backend/migration.mo": "Stub migration module that returns an empty state without changes.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs for two broadcaster start‑flow features.",
  "frontend-file-summaries.txt": "A prewritten set of file summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base and theme variable setup defining color tokens and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML shell mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, broadcaster, viewer join, and viewer watch pages inside FootballLayout.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "UI button component for toggling the broadcaster's microphone with loading, error-retry, and enabled/disabled states.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Game control panel with a flag‑event dialog allowing selection of team and reason before submitting flag events.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Helper UI explaining microphone permission or device errors with a retry option.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Helper UI for camera permission or device errors with explanatory text and a retry button.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Provides UI controls to edit and update scoreboard scores and team roles using mutation hooks.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Displays the session code with copy-to-clipboard functionality for sharing a broadcast.",
  "frontend/src/components/events/EventFeed.tsx": "Shows a scrollable list of game events with icons and timestamps.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Renders a styled overlay announcing a flag event on either side of the screen.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Temporarily displays the latest event in a top-center overlay that auto-hides.",
  "frontend/src/components/layout/FootballLayout.tsx": "Provides the main page layout with header, footer, branding, and social links.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Shows an on-camera scoreboard bar with team icons, scores, and offense indicators.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Wraps scoreboard-related content in a styled card with a title and optional icon.",
  "frontend/src/components/system/UnsupportedState.tsx": "Displays a warning card when the user's browser lacks required features for broadcasting.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Shows viewer subtitles or a warning when captions are unavailable.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Handles live stream video display with loading, error, ended, and waiting states.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session lifecycle, generating session codes and calling backend mutations to start or end sessions.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "Builds a combined broadcast MediaStream from video and optional microphone audio, handling mic toggling and track management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, loading stored identities and exposing login, logout, and status utilities.",
  "frontend/src/hooks/useMicrophone.ts": "Handles microphone access, activation, errors, and media track management with configurable audio constraints.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for session metadata, events, scoreboard, and session mutations.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and retrieves the current session code in localStorage with simple setters and clear functionality.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Derives session state (waiting, live, ended) based on metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech-to-text using the browser SpeechRecognition API, managing listening state, transcript, and errors.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Manages timed display of the latest unseen flag event and persists seen flags in sessionStorage.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Handles viewer-side WebRTC setup for live video, tracks connection state, and reports signaling errors.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode overrides, and global background styling.",
  "frontend/src/lib/teamIcons.ts": "Provides team icon metadata and helpers to get icon info and scoreboard team names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BroadcasterPage.tsx": "Main broadcaster interface managing camera, mic, captions, events, scoreboard, and flag overlays.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering navigation to broadcast or watch modes.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Page for entering and validating a session code before joining a live stream.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer page that loads session data, events, scoreboard, captions, and displays video with dynamic overlays plus subtitle toggling and leave-session handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata outlining app purpose, architectural notes, known issues, and existing features for a football-themed live streaming system."
}