{
  "backend/main.mo": "Motoko backend managing sessions with events, scoreboard, captions, and lifecycle updates including start, icon selection, event logging, and end.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing functionality across pages, hooks, components, and layouts.",
  "frontend/index.css": "Tailwind base/theme definitions providing color variables, dark mode overrides, and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, broadcast, viewer join, and viewer watch pages.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "UI button component toggling mic state with loading and retry handling.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Control panel enabling broadcasters to submit flag events with a dialog for team selection and reason entry.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Helper component displaying microphone-related errors with messaging and a retry action.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Helper component showing camera access errors and offering a retry button.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Provides UI controls for adjusting team scores and roles, and updates the scoreboard via a mutation.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Displays the session code and allows users to copy it to the clipboard.",
  "frontend/src/components/events/EventFeed.tsx": "Renders a scrollable list of game events with icons and timestamps.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Shows a styled overlay announcing a flag event for a specific team.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Displays a temporary overlay highlighting the most recent event.",
  "frontend/src/components/layout/FootballLayout.tsx": "Defines the main app layout with header, footer, and social links.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Renders an on-camera scoreboard bar with team icons, scores, and offense indicators.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Provides a styled card wrapper for scoreboard-related sections.",
  "frontend/src/components/system/UnsupportedState.tsx": "Shows a warning card when the browser lacks required features for broadcasting.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Displays viewer captions or an unavailable message depending on state.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Handles live stream playback with lifecycle state overlays and connection error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session lifecycle, including generating codes and starting or ending sessions via backend mutations.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "Builds a combined MediaStream for broadcasting, managing video tracks and dynamic microphone enable/disable behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identity loading, and auth client setup.",
  "frontend/src/hooks/useMicrophone.ts": "Controls microphone access with support checks, stream start/stop, error handling, and optional audio constraint configuration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating session data such as metadata, events, scoreboard, and session actions.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and retrieves the current session code in localStorage with helpers to update or clear it.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Determines session lifecycle state (waiting, live, ended, unknown) based on metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser speech recognition to track support, listening state, transcripts, errors, and start/stop control.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Manages timed display of unseen flag events, tracking seen items in memory and sessionStorage and auto‑dismissing overlays.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Sets up a viewer-side WebRTC connection for live streams, handling peer connection state, errors, and retry logic.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, theming, background styling, and utility classes for scoreboard UI.",
  "frontend/src/lib/teamIcons.ts": "Provides team icon metadata and helpers for retrieving icon info and scoreboard team names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BroadcasterPage.tsx": "Main broadcaster interface managing camera, mic, captions, scoreboard controls, events, and flag overlays.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering navigation to broadcasting or viewing sessions.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Form page for entering and validating session codes before joining a viewer session.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer watch page that loads session data, events, scoreboard, flags, captions, and renders the video player with multiple overlays plus a sidebar event feed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata containing app summary, architecture notes, known issues, and feature tracking for the live streaming system."
}