{
  "backend/main.mo": "Motoko actor implementing session management, scoreboard tracking, event logging, and caption handling for a football broadcast system with team icons, roles, and flag events.",
  "feature_evidence.json": "Feature evidence report documenting a change to CelebrationOverlay component to reduce font size and reposition celebration score text below the celebration image.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing a football broadcast app with local recording, scoreboard management, event tracking, camera controls, and celebration overlays.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a football-themed UI.",
  "frontend/index.html": "HTML entry point for 'Gridiron Live' application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing page and broadcaster page wrapped in FootballLayout.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "Toggle button component for broadcaster microphone control with loading, error, and retry states.",
  "frontend/src/components/broadcast/CelebrationOverlay.tsx": "Overlay component displaying team celebration image and score text positioned on the left side, stacked vertically with image above text.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Game control panel with Flag button that opens a dialog for selecting team and entering flag reason, then calls onAddFlagEvent callback.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Help component displaying microphone error messages with retry button for permission, not-found, and not-supported error types.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Help component displaying camera permission error messages with retry button for permission and not-found error types.",
  "frontend/src/components/broadcast/QuarterControls.tsx": "Quarter timer control panel with start/pause, reset, next quarter, and halftime toggle buttons displaying current phase and formatted time.",
  "frontend/src/components/broadcast/QuarterTimerOverlay.tsx": "Displays a semi-transparent overlay in the top-left corner showing the current game phase and formatted time with white text on a dark background.",
  "frontend/src/components/broadcast/RecordingControls.tsx": "Provides recording controls including start/stop buttons, duration display, camera switching, and a zoom slider (1.0x-3.0x) that applies CSS transforms to the video element.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Manages scoreboard state with increment/decrement buttons for team scores, offense/defense role switching, and triggers celebration overlays when scores change.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Empty file with no content.",
  "frontend/src/components/events/EventFeed.tsx": "Displays a scrollable list of game events (flags and trophies) with timestamps, descriptions, and icons in a card layout.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Shows a red animated overlay on the left or right side of the screen announcing flag events with team name and reason.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Displays the most recent game event in a centered top overlay that auto-hides after 5 seconds with slide-in animation.",
  "frontend/src/components/layout/FootballLayout.tsx": "Main layout wrapper with header (logo, title, social links), main content area, and footer with Caffeine.ai attribution and copyright.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty file with no content.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Renders a compact bottom scoreboard overlay for camera view showing team icons, scores, names, offense indicators with arrows, and optional ThrowOff label.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Reusable card wrapper component with title, optional icon, and styled border/backdrop for scoreboard-related content.",
  "frontend/src/components/system/UnsupportedState.tsx": "Displays an error card when the browser lacks required features (getUserMedia, WebRTC) with recommendations for supported browsers.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Shows live captions in a centered top overlay when enabled, or displays a warning message if broadcaster captions are unavailable.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "React component that displays a live stream video player for viewers with different states (waiting, live, ended) and connection status overlays including loading, error, and retry functionality.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "React hook that manages broadcaster session lifecycle with states (idle, starting, live, ending) and methods to start/end sessions with team icons and broadcaster name.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "React hook that combines video and audio tracks into a single broadcast MediaStream, managing microphone enable/disable state and track lifecycle.",
  "frontend/src/hooks/useCelebrationOverlay.ts": "React hook that manages a celebration overlay with auto-dismiss timer (8 seconds), allowing triggering and clearing of team-specific celebrations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useMicrophone.ts": "React hook that manages microphone access with getUserMedia, providing start/stop/retry controls, error handling for permissions and device availability, and configurable audio quality settings.",
  "frontend/src/hooks/useQuarterTimer.ts": "React hook that implements a basketball game quarter timer with 6-minute quarters, managing phases (Q1-Q4, Halftime), countdown logic, and controls for start/pause/reset/next quarter.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating session data (metadata, events, scoreboard, flags) and managing sessions (start, end, add events, set team icons). All hooks use the actor from useActor and invalidate queries on mutations.",
  "frontend/src/hooks/useSessionCode.ts": "Provides a hook to manage session code state synchronized with localStorage, exposing setSessionCode and clearSessionCode functions.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Determines session lifecycle state ('waiting', 'live', 'ended', 'unknown') based on metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser SpeechRecognition API to provide continuous speech-to-text with interim results, exposing start/stop controls, transcript, and error state.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Manages timed display of flag event overlays, showing the latest unseen flag for 3 seconds and tracking seen flags in sessionStorage to prevent reappearance.",
  "frontend/src/hooks/useVideoRecorder.ts": "Provides video recording functionality using MediaRecorder API with multiple codec support (prioritizing MP4/H.264), duration tracking, and automatic download on stop.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Attempts to establish WebRTC peer connection for live stream viewing with ICE/STUN configuration, but currently shows error indicating backend signaling endpoints are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, football field background image, and utility classes for scoreboard text and broadcast glow effects.",
  "frontend/src/lib/teamIcons.ts": "Defines team icon metadata (dolphin, bullfrog, fist, tornado) with labels, image paths, and helper functions to retrieve icon info and celebration images.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and InternetIdentity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/BroadcasterPage.tsx": "Main broadcaster page component that integrates camera, video recording, quarter timer, scoreboard, events, and celebration overlays with controls for managing a live football game broadcast.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a hero section and a card that navigates users to the broadcast recording page.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Empty file for viewer join page (not yet implemented).",
  "frontend/src/pages/ViewerWatchPage.tsx": "Empty file for viewer watch page (not yet implemented).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking an existing feature to reduce celebration score text font size and reposition it below the celebration image in the CelebrationOverlay component."
}