{
  "backend/main.mo": "Motoko actor implementing session management, scoreboard tracking, event logging (flags/points), team icon selection, and caption storage for a football broadcast application.",
  "feature_evidence.json": "Feature evidence report documenting two UI repositioning tasks: moving quarter control buttons to align with point controls, and relocating the quarter timer to the top-left video overlay.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components, hooks, pages, and layouts for a football broadcast/viewer application with camera, scoreboard, events, and captions.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for football-themed UI including sidebar, charts, and destructive colors.",
  "frontend/index.html": "HTML entry point for 'Gridiron Live' application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for landing, broadcaster, viewer join, and viewer watch pages, all wrapped in FootballLayout.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "Toggle button component for broadcaster microphone control with loading, error, and retry states.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Game controls card with Flag button that opens a dialog for team selection and reason input, with loading state handling for scoreboard initialization.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Help component displaying microphone error messages (permission, not-found, not-supported) with retry button.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Help component displaying camera permission error messages with retry functionality.",
  "frontend/src/components/broadcast/QuarterControls.tsx": "A card component that displays quarter timer controls with play/pause, reset, next quarter, and halftime toggle buttons. Shows the current phase and formatted time with conditional button states based on game phase and running status.",
  "frontend/src/components/broadcast/QuarterTimerOverlay.tsx": "A simple overlay component that displays the current game phase and formatted time in the top-left corner with a semi-transparent black background.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "A comprehensive scoreboard control panel that allows updating team scores and offensive/defensive roles with increment/decrement buttons. Manages local state and syncs changes to the backend via mutation hooks.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "A card component that displays the broadcast session code with a copy-to-clipboard button. Shows visual feedback when the code is successfully copied.",
  "frontend/src/components/events/EventFeed.tsx": "Displays a scrollable list of game events (flags and scores) with timestamps and icons. Shows a placeholder message when no events exist.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "An animated overlay component that displays flag penalty announcements on either the left or right side of the screen with team name and reason.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "A temporary overlay that appears at the top center of the screen to display the latest game event for 5 seconds with fade-in animation.",
  "frontend/src/components/layout/FootballLayout.tsx": "The main application layout wrapper with header (logo, title, social links), main content area, and footer with copyright and Caffeine.ai attribution.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "An empty component file with no content.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "A bottom-aligned scoreboard overlay showing both teams' icons, names, scores, and offensive possession indicator with VillanSpoon branding.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "A reusable card wrapper component for scoreboard-related content with a title, optional icon, and styled border/backdrop.",
  "frontend/src/components/system/UnsupportedState.tsx": "An error state component that displays when the browser lacks required features (getUserMedia, WebRTC) with recommendations for supported browsers.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "A conditional overlay that displays live captions at the top of the viewer screen, with special handling for unavailable captions and empty text.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "React component that displays a live stream video player for viewers with overlays for waiting, live, ended, and error states, using the useViewerLiveStream hook to manage WebRTC connection.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "React hook that manages broadcaster session lifecycle (idle, starting, live, ending, ended), generating session codes and coordinating start/end mutations with team icon setup.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "React hook that combines video and audio tracks into a single broadcast MediaStream, managing microphone enable/disable state and track lifecycle.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMicrophone.ts": "React hook that manages microphone access and audio stream capture with configurable quality settings, error handling for permissions/support, and start/stop/retry functionality.",
  "frontend/src/hooks/useQuarterTimer.ts": "React hook that implements a basketball game quarter timer with 6-minute quarters, halftime support, and controls for start/pause/reset/next quarter operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching session metadata, events, scoreboard, and flag events, plus mutations for starting/ending sessions, setting team icons, and adding events/flags/captions.",
  "frontend/src/hooks/useSessionCode.ts": "Provides a hook to manage session code state in both React state and localStorage, with methods to set and clear the code.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Determines session lifecycle state ('waiting', 'live', 'ended', 'unknown') based on metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser SpeechRecognition API to provide continuous speech-to-text transcription with start/stop controls and error handling.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Manages timed display of flag event overlays, showing the latest unseen flag for a configurable duration and tracking seen flags in sessionStorage.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Attempts to establish a WebRTC peer connection for viewing live video streams, but currently shows an error indicating backend signaling endpoints are not yet implemented.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, football field background image, and utility classes for scoreboard text and broadcast glow effects.",
  "frontend/src/lib/teamIcons.ts": "Exports team icon metadata (dolphin, bullfrog, fist, tornado) with image paths and provides helper functions to retrieve icon info and scoreboard team names.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/BroadcasterPage.tsx": "Main broadcaster interface managing session lifecycle, camera/microphone/speech controls, scoreboard/quarter/flag overlays, and event feed with real-time updates.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with two cards: one for starting a broadcast and one for watching a game by entering a session code.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Viewer join page where users enter and validate a 6-character session code to watch a live game, with error handling and navigation.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Main viewer page displaying live video with overlays (scoreboard, events, flags, subtitles), event feed sidebar, and subtitle toggle controls.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, animations, and plugin integrations.",
  "project_state.json": "Project metadata tracking architectural notes, existing features for repositioning quarter timer to top-left of video and moving quarter control buttons to point section controls area."
}