{
  "backend/main.mo": "Actor managing sessions with scoreboard, events, team icons, and lifecycle controls including start, set icons, add events, and end session.",
  "feature_evidence.json": "Feature evidence report mapping microphone-related feature requirements to implementation files and components.",
  "frontend-file-summaries.txt": "Text listing concise summaries for all frontend files including hooks, pages, layout, components, and camera logic.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and applying global background and border styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for landing, broadcast, join, and watch pages.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "Mic toggle button component showing mic on/off state, loading, retry mode, and disabled handling.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Control panel enabling broadcasters to submit flag events with team selection and reason entry, with blocking before team icons are set.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "UI component showing microphone-specific permission or device errors with retry support.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "UI component displaying camera permission or device errors with retry functionality.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Provides UI to adjust team scores and roles and submit updates via a mutation.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Displays the session code with a button to copy it to the clipboard.",
  "frontend/src/components/events/EventFeed.tsx": "Renders a scrollable list of game events with timestamps and icons.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Shows a styled overlay announcing a flag event for a specific team.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Displays a temporary overlay highlighting the most recent event.",
  "frontend/src/components/layout/FootballLayout.tsx": "Defines the main app layout with header, footer, and social links.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty file with no implementation.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Renders an on‑screen scoreboard overlay with team icons, scores, and offense indicator arrows.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Wraps scoreboard-related content in a styled card with a title and optional icon.",
  "frontend/src/components/system/UnsupportedState.tsx": "Shows an error card indicating the browser lacks required features for broadcasting.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Displays subtitles or a not‑supported message depending on browser capability and settings.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Shows a video player shell with lifecycle-dependent status messages and optional child content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session state, generating session codes and calling mutations to start or end sessions. Tracks live status and team icon setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity auth flow, including loading stored identities and handling login states. Wraps AuthClient configuration and exposes login/clear functions.",
  "frontend/src/hooks/useMicrophone.ts": "Controls microphone access with start/stop logic, browser support checks, and detailed error handling. Returns stream and track references along with state flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for session validation, starting/ending sessions, event mutations, and fetching events or metadata. Uses an actor to interact with backend canister methods.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and retrieves the current session code in localStorage. Provides setters and clear functionality.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Derives session lifecycle state based on metadata and loading status. Distinguishes waiting, live, ended, or unknown states.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech recognition hook handling start/stop, transcript updates, and error states. Uses browser SpeechRecognition APIs with continuous interim results.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Shows temporary overlays for new flag events, tracking seen flags in memory and sessionStorage. Automatically dismisses overlays after a set duration.",
  "frontend/src/index.css": "Tailwind base/styles plus custom OKLCH color variables, dark mode overrides, and utility classes for scoreboard text and broadcast glow.",
  "frontend/src/lib/teamIcons.ts": "Defines team icon metadata, lookup helpers, and mappings from icons to scoreboard-friendly names.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, then renders the root component.",
  "frontend/src/pages/BroadcasterPage.tsx": "UI and logic for broadcasters to start a session, manage camera/mic, view events, and control live overlays and scoreboard.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen offering navigation to broadcasting or watching a game.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Page for viewers to enter and validate a 6‑character session code before joining a stream.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer watch interface showing video, event overlays, scoreboard, subtitles, and session lifecycle handling.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, extended theme utilities, and plugins.",
  "project_state.json": "Defines the project’s current streaming app state, including broadcaster-only session rules, scoreboard and flag overlay behavior, known issues, and a list of implemented features. Serves as a specification snapshot for fixing and extending the football-themed live streaming system."
}