{
  "backend/main.mo": "Motoko backend managing sessions, events, captions, and scoreboard state with functions to start, update, and end broadcasts.",
  "feature_evidence.json": "Feature evidence report mapping UI fixes and scoreboard-related updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for routing, hooks, components, and broadcast UI.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode tokens, and shared utility styling.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router with routes for broadcaster and viewer pages inside a shared layout.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "Mic toggle button component handling mic enabled state, errors, retry, and loading UI.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Broadcast control panel providing a flag event dialog tied to scoreboard state and flag submission mutations.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Helper component displaying microphone permission or device errors with retry support.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "UI component showing camera permission or hardware errors with a retry action.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "UI for adjusting team scores and roles, sending updates via mutation. Provides increment/decrement controls and offense/defense toggles.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Displays the session code and provides a copy-to-clipboard button with visual feedback.",
  "frontend/src/components/events/EventFeed.tsx": "Shows a scrollable list of game events with icons and timestamps. Uses ScoreboardShell for layout.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Renders a styled overlay announcing a flag event on either left or right side of the screen.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Displays a temporary top-center overlay highlighting the most recent event for five seconds.",
  "frontend/src/components/layout/FootballLayout.tsx": "App layout with header, footer, social links, and theming for the Gridiron Live interface.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty file with no implementation.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Bottom overlay showing team icons, names, scores, and offense arrows for on-camera broadcasts.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Template card wrapper providing consistent title and styling for scoreboard-related sections.",
  "frontend/src/components/system/UnsupportedState.tsx": "Displays a warning card when the user's browser lacks required broadcasting features.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Shows captions or a warning when captions are unavailable, positioned at the top center.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Video player for viewers handling live, waiting, ended, and error states with overlays and retry logic.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session lifecycle, generating session codes and calling mutations to start or end sessions and set team icons.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "Builds a combined broadcast MediaStream from video and optional microphone audio, with logic to toggle and manage audio tracks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity restoration, and exposing identity state and helpers.",
  "frontend/src/hooks/useMicrophone.ts": "Controls microphone access with support checks, start/stop logic, error handling, and exposes audio stream and track.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor queries and mutations for session data, events, scoreboard updates, and related invalidation logic.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and retrieves the session code in localStorage with helper setters and clear functions.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Derives a session state ('waiting', 'live', or 'ended') from metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech‑to‑text using browser SpeechRecognition, managing listening state, transcript, and errors.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "React hook that shows the latest unseen flag event for a timed duration and tracks seen flags in sessionStorage.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Manages viewer-side WebRTC setup for receiving a live stream, handling connection state, errors, and retries.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables, field background, and utility classes for scoreboard UI.",
  "frontend/src/lib/teamIcons.ts": "Defines team icon metadata and helpers for retrieving icon info and scoreboard names.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/BroadcasterPage.tsx": "Main broadcaster interface handling camera/mic setup, session control, events, scoreboard, and overlays.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering navigation to broadcast or watch modes.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Page for entering and validating a session code before navigating to the viewer stream.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer page that loads session data, video, events, scoreboard, captions, and overlays, with UI for leaving the session and toggling subtitles.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON snapshot describing project state, architecture notes, known issues, and feature records for a football‑themed live streaming app."
}