{
  "backend/main.mo": "Defines the main backend actor managing sessions, events, scoreboard state, captions, and lifecycle operations such as starting, updating, and ending sessions.",
  "backend/migration.mo": "Provides a migration that adds an empty captions list to old session records when upgrading stored session data.",
  "feature_evidence.json": "Lists feature evidence mapping specific product features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for all major frontend source files used across the project.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theming for light and dark mode along with base styling overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the React Router route tree and wraps all pages in the FootballLayout component.",
  "frontend/src/components/broadcast/BroadcasterMicToggle.tsx": "UI button component allowing broadcasters to toggle or retry microphone input with loading and error states.",
  "frontend/src/components/broadcast/FootballControlPanel.tsx": "Provides broadcaster-side game controls including opening a dialog to submit flag events tied to selected teams.",
  "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx": "Displays microphone-related errors with guidance and a retry button.",
  "frontend/src/components/broadcast/PermissionsHelp.tsx": "Shows camera access errors and offers a retry option for camera permissions.",
  "frontend/src/components/broadcast/ScoreboardControls.tsx": "Provides UI to edit team scores and roles and submit updates to the scoreboard.",
  "frontend/src/components/broadcast/SessionCodeCard.tsx": "Shows the broadcast session code and allows copying it to the clipboard.",
  "frontend/src/components/events/EventFeed.tsx": "Displays a scrollable list of game events with timestamps and icons.",
  "frontend/src/components/events/FlagAnnouncementOverlay.tsx": "Shows a prominent overlay announcing a flag event for a specific team.",
  "frontend/src/components/events/LatestEventOverlay.tsx": "Temporarily displays the most recent event in an animated overlay.",
  "frontend/src/components/layout/FootballLayout.tsx": "Page layout with header, footer, branding, and social links for the app.",
  "frontend/src/components/scoreboard/BottomScorebar.tsx": "Empty file with no implemented content.",
  "frontend/src/components/scoreboard/OnCameraScoreboardOverlay.tsx": "Renders an on-screen scoreboard overlay with team names, scores, and offense indicators.",
  "frontend/src/components/scoreboard/ScoreboardShell.tsx": "Card-style wrapper providing consistent scoreboard UI structure with a title and optional icon.",
  "frontend/src/components/system/UnsupportedState.tsx": "Informs users their browser lacks required features for broadcasting and suggests alternatives.",
  "frontend/src/components/viewer/ViewerSubtitlesOverlay.tsx": "Shows viewer captions or a warning when captions are unavailable.",
  "frontend/src/components/viewer/ViewerVideoPlayer.tsx": "Video player UI that renders live, waiting, or ended stream states and handles loading, errors, and retry using useViewerLiveStream.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when identity changes.",
  "frontend/src/hooks/useBroadcasterSession.ts": "Manages broadcaster session lifecycle including generating session codes, starting sessions, setting team icons, and ending sessions.",
  "frontend/src/hooks/useBroadcastMediaStream.ts": "Combines video and optional audio tracks into a broadcast MediaStream and manages mic-enabled state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handles login and stored identity loading, and exposes identity state helpers.",
  "frontend/src/hooks/useMicrophone.ts": "Controls microphone access, tracks support and errors, and manages audio stream lifecycle with start/stop and retry.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for session metadata, events, scoreboards, and mutations like startSession, setTeamIcons, and endSession.",
  "frontend/src/hooks/useSessionCode.ts": "Stores and retrieves a session code in localStorage with helpers to set and clear it.",
  "frontend/src/hooks/useSessionLifecycle.ts": "Determines session lifecycle state based on metadata and loading status.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping Web Speech API to manage listening state, transcripts, and errors.",
  "frontend/src/hooks/useTimedFlagOverlay.ts": "Manages timed display of unseen flag events with sessionStorage persistence and auto-dismiss.",
  "frontend/src/hooks/useViewerLiveStream.ts": "Simulates viewer livestream connection state, tracking errors and retry logic for a video element.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark theme overrides, and utility classes.",
  "frontend/src/lib/teamIcons.ts": "Defines team icon metadata and helpers for retrieving icon info and scoreboard names.",
  "frontend/src/main.tsx": "App entry point setting up React Query, identity provider, and rendering the root component.",
  "frontend/src/pages/BroadcasterPage.tsx": "Broadcaster control page handling camera, microphone, speech captions, scoreboard, and live session UI.",
  "frontend/src/pages/LandingPage.tsx": "Landing page offering navigation to broadcast or viewer join flows.",
  "frontend/src/pages/ViewerJoinPage.tsx": "Page for entering and validating a session code before navigating to a live viewer session.",
  "frontend/src/pages/ViewerWatchPage.tsx": "Viewer watch page that loads session data, events, scoreboard, captions, and renders the video player with overlays plus an event feed and subtitle toggle.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state file describing the app’s current features, architectural notes, issues, and versioned metadata for the live streaming system."
}