{
  "kind": "build_request",
  "title": "Fix live stream playback (viewer video/audio) and move subtitles to top of video",
  "projectName": "VillanSpoon Live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Replace the current placeholder viewer live-stream implementation so that viewers can actually connect to and play the broadcaster’s live stream when a session is in the \"live\" lifecycle state (no forced \"Stream Unavailable\" simulation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "it still doesnt work",
          "1 all of it"
        ]
      },
      "acceptanceCriteria": [
        "When the broadcaster is live, the Viewer Watch page renders the broadcaster’s actual camera video instead of always showing the \"Stream Unavailable\" overlay.",
        "The viewer connection logic no longer unconditionally sets an error after a timeout (remove the simulated failure path in the live connection flow).",
        "Retry Connection triggers a real reconnection attempt and can recover from a transient disconnect without reloading the page."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Ensure the broadcaster-to-viewer streaming pipeline is fully implemented end-to-end, including session-scoped signaling/state in the Motoko backend if required, so that a viewer joining with a valid session code can establish a working in-browser real-time connection to the broadcaster (video + audio).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "it still doesnt work",
          "1 all of it"
        ]
      },
      "acceptanceCriteria": [
        "A viewer joining a live session by session code can establish a successful connection and see live video within the Viewer Watch video element.",
        "A viewer joining after the broadcaster is already live can still connect and see the current live video (late join works).",
        "The backend exposes whatever session-code-scoped signaling/state endpoints are needed for the chosen in-browser real-time protocol, and the frontend uses them to complete negotiation.",
        "No third-party streaming providers are introduced."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Fix broadcaster-to-viewer audio so that when the broadcaster mic toggle is ON, the outgoing stream includes an enabled audio track and viewers can reliably hear the broadcaster during a live session.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "it still doesnt work",
          "1 all of it"
        ]
      },
      "acceptanceCriteria": [
        "With mic enabled on the broadcaster page, viewers hear the broadcaster audio during a live session.",
        "Toggling the broadcaster mic OFF stops audio for viewers; toggling it back ON restores audio without requiring a page refresh.",
        "The viewer video element is configured to play audio (not muted) and remains compatible with mobile autoplay constraints (e.g., playsInline)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Move the subtitles/captions overlay to the top of the video (inside the video container) for BOTH the broadcaster camera preview and the viewer watch view, while keeping existing styling readable over video.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "the subtitles are at the top",
          "2top of the video 3both"
        ]
      },
      "acceptanceCriteria": [
        "On the Viewer Watch page, enabled subtitles render near the top of the video container (not the bottom).",
        "On the Broadcaster page camera preview, the live transcript/caption overlay renders near the top of the video container (not the bottom).",
        "Caption overlays do not overlap the on-camera bottom scoreboard overlay (scoreboard remains unobstructed)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if existing stable state requires migration.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text.",
    "Keep streaming implementation browser-based with backend-assisted signaling/state; do not add third-party streaming providers."
  ],
  "nonGoals": [
    "Adding new unrelated UI features beyond stream reliability and moving subtitle overlay position.",
    "Implementing third-party authentication (only Internet Identity is allowed).",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}