{
  "kind": "build_request",
  "title": "Fix broadcaster audio and add mic toggle (default ON)",
  "projectName": "VillanSpoon Live",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Ensure the broadcaster stream captures and transmits microphone audio so viewers can hear the broadcaster reliably during a live session (i.e., the outgoing stream must include an audio track when mic is enabled).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "1 yes 2 yes 3yes"
        ]
      },
      "acceptanceCriteria": [
        "When a broadcast is live and the broadcaster has granted microphone permission, viewers hear the broadcaster audio while watching the stream.",
        "The broadcaster stream includes an audio track (not video-only) when mic is enabled.",
        "If microphone permission is denied/unavailable, the UI clearly indicates that audio is not being sent and provides a retry path without breaking the video stream."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a broadcaster mic on/off toggle control during live streaming, defaulting to mic ON when the broadcast starts, and make the toggle immediately affect whether microphone audio is sent to viewers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "1 yes 2 yes 3yes"
        ]
      },
      "acceptanceCriteria": [
        "A mic toggle is visible on the Broadcaster live view while streaming (not just during pre-live setup).",
        "Mic defaults to ON at the start of a broadcast.",
        "Toggling mic OFF stops sending microphone audio to viewers without ending the broadcast or stopping video.",
        "Toggling mic back ON resumes sending microphone audio to viewers (without requiring restarting the whole session, unless the browser requires re-permission/re-acquire—in that case show a clear instruction and a retry action).",
        "The toggle label/state uses English user-facing text (e.g., \"Mic On\" / \"Mic Off\")."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Update broadcaster-side permission/error handling to cover microphone access (in addition to camera), including clear English messaging when mic is blocked/unavailable and guidance to enable it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "1 yes 2 yes 3yes"
        ]
      },
      "acceptanceCriteria": [
        "If the user blocks microphone permission, the broadcaster UI shows a clear microphone-specific error state and guidance.",
        "If the device has no microphone or the browser cannot capture audio, the broadcaster UI shows an unsupported/unavailable message for mic capture.",
        "Camera-only operation remains possible even when mic capture is unavailable (video preview continues)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not edit files listed in frontend.immutablePaths (compose around them instead).",
    "Backend must remain single-actor Motoko; only add backend changes if strictly required for audio delivery."
  ],
  "nonGoals": [
    "Implementing third-party audio processing, noise suppression services, or external streaming providers.",
    "Adding multi-party voice chat or viewer-to-broadcaster audio.",
    "Adding recording or saving audio/video to backend storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}