{
  "kind": "build_request",
  "title": "Fix broadcaster pre-live team selection not recognized after going live",
  "projectName": "VillanSpoon Live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-45",
      "text": "Fix the broadcaster live UI so it correctly recognizes that Team A and Team B were selected during the pre-live setup and does not continue showing messaging that teams must be selected after the broadcast starts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-10",
          "msg-14"
        ],
        "quotes": [
          "ever since i made it so you choose the teams before you start the brodcast it says i need to select teams to do it even tho i did",
          "yes yes when the stream starts",
          "yes yes yes",
          "go"
        ]
      },
      "acceptanceCriteria": [
        "After selecting Team A and Team B on the broadcaster start screen and starting the broadcast, the broadcaster live page does not show any persistent message/tooltip indicating teams still need to be selected.",
        "The Game Controls panel (Flag) is enabled once the scoreboard data is available, and the UI uses the current team names derived from the selected team icons (Titans/Twisters/Bullfrogs/Dolphins) instead of generic Team A/Team B.",
        "If scoreboard data is still loading right after the session starts, any temporary disabled/loading state clears automatically once the scoreboard query resolves (no manual refresh required)."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Ensure the broadcaster Game Controls (Flag dialog) receives the current scoreboard state from the broadcaster page so that team selection readiness and team naming are driven by backend scoreboard data rather than missing/undefined props.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-10",
          "msg-14"
        ],
        "quotes": [
          "ever since i made it so you choose the teams before you start the brodcast it says i need to select teams to do it even tho i did",
          "yes yes when the stream starts",
          "yes yes yes",
          "go"
        ]
      },
      "acceptanceCriteria": [
        "When broadcasting is live, opening the Flag dialog shows the two team buttons labeled with the mapped names from the current scoreboard icons (not generic placeholders).",
        "The Flag button is not permanently blocked solely due to the scoreboard prop being omitted; the blocked/disabled logic reflects the actual presence of fetched scoreboard data.",
        "Submitting a flag event works immediately after going live (once scoreboard is loaded), without requiring re-selecting teams."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited directly; compose them as-is.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Changing the team icon restriction list (must remain exactly: dolphin, bullfrog, fist, tornado).",
    "Redesigning the broadcaster start flow beyond fixing the incorrect post-start 'select teams' behavior.",
    "Adding new backend endpoints or changing backend schema/state solely for this UI bug fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}