{
  "kind": "build_request",
  "title": "Fix viewer black screen, broadcaster audio delivery, and broadcaster-sourced subtitles",
  "projectName": "VillanSpoon Live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Fix the Viewer Watch experience so viewers can see the broadcaster’s live camera video instead of a black/empty screen when the session lifecycle is live.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "1 black screen"
        ]
      },
      "acceptanceCriteria": [
        "When a session is live, the Viewer Watch page renders a real video element (not just status text) and attempts to play the incoming stream.",
        "If the incoming stream is not available/negotiation fails, show a clear in-player error state (English) instead of a silent black screen.",
        "Overlays (latest event, flag overlay, scoreboard, subtitles) remain rendered within the video container and do not break video playback."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Fix broadcaster-to-viewer audio so that when the broadcaster mic toggle is ON, viewers reliably hear the broadcaster during a live session.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "3 yes and i have it on just viewers cant hear"
        ]
      },
      "acceptanceCriteria": [
        "During a live session with mic ON, the outgoing stream used for broadcasting includes an enabled audio track derived from the broadcaster microphone capture.",
        "A newly joined viewer can hear audio without needing the broadcaster to restart the session.",
        "Toggling the broadcaster mic OFF stops sending microphone audio to viewers; toggling back ON restores viewer audio without restarting the entire broadcast."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Change subtitles so that viewer subtitles reflect the broadcaster’s speech (broadcaster microphone) rather than the viewer’s own microphone.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "the subtitles only work for them and not whats coming from my mic",
          "2 brodcaster"
        ]
      },
      "acceptanceCriteria": [
        "Enabling subtitles on the Viewer Watch page does not request or use the viewer’s microphone.",
        "When subtitles are enabled on the viewer side and the broadcaster is speaking, viewers see captions that track the broadcaster’s speech.",
        "If the broadcaster’s browser does not support SpeechRecognition (or it errors), show a clear English message to the broadcaster and viewers that broadcaster subtitles are unavailable (while video/audio can continue)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Add backend support for broadcaster-sourced caption delivery so viewers can fetch the latest caption text for a given session code (no third-party services).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "the subtitles only work for them and not whats coming from my mic",
          "2 brodcaster"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a canister method for the broadcaster to publish caption updates for a session code.",
        "Backend exposes a canister query method for viewers to retrieve the most recent caption (and timestamp) for a session code.",
        "Caption publishing is rejected if the session code does not exist or the session has ended, with a clear trapped error message (English)."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the Viewer Watch subtitles UI to consume broadcaster-published captions (polling via React Query) and display them using the existing in-video caption overlay styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "the subtitles only work for them and not whats coming from my mic",
          "2 brodcaster"
        ]
      },
      "acceptanceCriteria": [
        "Viewer subtitle toggle controls whether broadcaster captions are fetched/displayed; disabling subtitles stops polling for captions.",
        "ViewerSubtitlesOverlay continues to show “Subtitles are not supported in this browser” only when subtitles truly cannot be displayed; it must not imply the viewer needs speech recognition to see broadcaster captions.",
        "Captions render inside the video container at the same overlay position as today and update as new caption text arrives."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is actually required.",
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for all user-facing UI/error text."
  ],
  "nonGoals": [
    "Do not add third-party streaming providers or external speech-to-text services.",
    "Do not add third-party authentication (only Internet Identity is allowed).",
    "Do not implement real-time WebSocket-based caption delivery; use existing request/response + polling patterns (React Query)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}