{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reposition quarter timer and control buttons",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move quarter control buttons to the same position as point section controls in broadcaster interface",
      "acceptanceCriteria": [
        "Quarter control buttons appear in the same layout area as the point tracking controls",
        "Both control sections maintain visual consistency and alignment",
        "All buttons remain fully functional after repositioning"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Relocate the quarter control buttons (Start, Pause, Reset, Next Quarter) from their current position to align with the point section controls. Ensure the buttons maintain their existing functionality and event handlers while being repositioned within the layout to match the visual alignment of the point tracking controls."
        },
        {
          "path": "frontend/src/components/broadcast/FootballControlPanel.tsx",
          "operation": "modify",
          "description": "Update the control panel layout to incorporate the quarter control buttons alongside the point section controls. Adjust the component structure to ensure both control sections share consistent spacing, visual styling, and alignment while maintaining all existing flag event dialog functionality."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reposition quarter timer display to top-left corner of camera video feed overlay",
      "acceptanceCriteria": [
        "Quarter timer appears overlaid on the video feed at the top-left position",
        "Timer remains visible and readable throughout the broadcast",
        "Timer position does not interfere with other video overlays"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Move the quarter timer display from its current location to appear as an overlay on the video feed at the top-left corner. Use absolute positioning within the video container to place the timer overlay, ensuring it remains visible and does not conflict with existing video overlays like the scoreboard or flag announcements."
        }
      ]
    }
  ]
}