{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix broadcaster microphone audio capture and add live mic toggle",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Capture microphone audio on the broadcaster and ensure the outgoing live stream includes an audio track when mic is enabled, with a clear fallback state when mic is unavailable.",
      "acceptanceCriteria": [
        "When a broadcast is live and the broadcaster has granted microphone permission, viewers hear the broadcaster audio while watching the stream.",
        "The broadcaster stream includes an audio track (not video-only) when mic is enabled.",
        "If microphone permission is denied/unavailable, the UI clearly indicates that audio is not being sent and provides a retry path without breaking the video stream."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMicrophone.ts",
          "operation": "create",
          "description": "Create a dedicated React hook to request and manage microphone capture (permission/unsupported/not-found states, loading, retry), and expose the current MediaStreamTrack/MediaStream for integration into the live broadcast stream. Ensure it supports re-acquire after denial or device change."
        },
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Integrate microphone capture into the broadcaster live flow: on broadcast start, attempt to acquire mic (default ON) and merge an audio track into the same outgoing MediaStream used for broadcasting (while keeping the camera preview/video running). Use the selected \"camera\" component via its read-only useCamera hook for video capture; Verify the component's usage instructions before implementing. Add logic to avoid duplicating audio tracks and to keep video-only streaming functional when mic is unavailable/blocked."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Add an in-stream mic on/off toggle (default ON) that immediately controls whether microphone audio is sent to viewers without interrupting video.",
      "acceptanceCriteria": [
        "A mic toggle is visible on the Broadcaster live view while streaming (not just during pre-live setup).",
        "Mic defaults to ON at the start of a broadcast.",
        "Toggling mic OFF stops sending microphone audio to viewers without ending the broadcast or stopping video.",
        "Toggling mic back ON resumes sending microphone audio to viewers (without requiring restarting the whole session, unless the browser requires re-permission/re-acquire—in that case show a clear instruction and a retry action).",
        "The toggle label/state uses English user-facing text (e.g., \"Mic On\" / \"Mic Off\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/broadcast/BroadcasterMicToggle.tsx",
          "operation": "create",
          "description": "Create a small UI control for the broadcaster live view that shows a mic toggle with English labels (\"Mic On\"/\"Mic Off\"), supports disabled/loading states, and triggers onToggle/onRetry callbacks without touching shadcn UI source files."
        },
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Wire the mic toggle into the live broadcaster UI (visible while LIVE): default micEnabled=true when the session transitions to live; toggling OFF disables/removes the active audio track from the outgoing stream immediately; toggling ON re-enables or re-acquires mic as needed and re-attaches the audio track. Keep the video stream and camera preview uninterrupted. Use the selected \"camera\" component via the read-only useCamera hook for video capture; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Add microphone-specific permission/availability error handling and guidance on the broadcaster side while allowing camera-only operation.",
      "acceptanceCriteria": [
        "If the user blocks microphone permission, the broadcaster UI shows a clear microphone-specific error state and guidance.",
        "If the device has no microphone or the browser cannot capture audio, the broadcaster UI shows an unsupported/unavailable message for mic capture.",
        "Camera-only operation remains possible even when mic capture is unavailable (video preview continues)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/broadcast/MicrophonePermissionsHelp.tsx",
          "operation": "create",
          "description": "Create a microphone-specific permissions/help component that displays clear English messaging for mic permission blocked/denied, no mic found, and not supported/unavailable, and includes a retry action for re-requesting mic access."
        },
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Display mic-specific status and guidance in the LIVE broadcaster view: when mic capture fails, show MicrophonePermissionsHelp and indicate that audio is not being sent while keeping video preview and broadcasting active. Ensure the retry action re-attempts mic acquisition without breaking the session. Use the selected \"camera\" component via the read-only useCamera hook for video capture; Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}