{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Broadcaster live UI: recognize pre-live team selection and fix Flag/Game Controls readiness",
  "requirements": [
    {
      "id": "REQ-45",
      "summary": "Ensure the broadcaster live page uses fetched scoreboard state (with team icons) to clear any post-start 'select teams' messaging and enable Game Controls once available.",
      "acceptanceCriteria": [
        "After selecting Team A and Team B on the broadcaster start screen and starting the broadcast, the broadcaster live page does not show any persistent message/tooltip indicating teams still need to be selected.",
        "The Game Controls panel (Flag) is enabled once the scoreboard data is available, and the UI uses the current team names derived from the selected team icons (Titans/Twisters/Bullfrogs/Dolphins) instead of generic Team A/Team B.",
        "If scoreboard data is still loading right after the session starts, any temporary disabled/loading state clears automatically once the scoreboard query resolves (no manual refresh required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Pass the fetched scoreboard into the Game Controls panel and drive the panel disabled/loading state from the scoreboard query state (instead of treating missing props as 'teams not selected'). Ensure the UI transitions automatically from temporary 'loading/disabled' to enabled once the scoreboard query resolves."
        },
        {
          "path": "frontend/src/components/broadcast/FootballControlPanel.tsx",
          "operation": "modify",
          "description": "Update the Flag button tooltip/helper text so that when scoreboard is temporarily unavailable right after going live it indicates a loading/initializing state (not 'select team icons'), and ensure the message disappears as soon as scoreboard data is present."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Wire current scoreboard state into the Flag dialog so team labels and readiness are driven by actual scoreboard data and not undefined/omitted props.",
      "acceptanceCriteria": [
        "When broadcasting is live, opening the Flag dialog shows the two team buttons labeled with the mapped names from the current scoreboard icons (not generic placeholders).",
        "The Flag button is not permanently blocked solely due to the scoreboard prop being omitted; the blocked/disabled logic reflects the actual presence of fetched scoreboard data.",
        "Submitting a flag event works immediately after going live (once scoreboard is loaded), without requiring re-selecting teams."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BroadcasterPage.tsx",
          "operation": "modify",
          "description": "Ensure FootballControlPanel receives a non-undefined scoreboard prop sourced from the live scoreboard query, so the Flag dialog has access to current icon-based team identity as soon as the query returns."
        },
        {
          "path": "frontend/src/components/broadcast/FootballControlPanel.tsx",
          "operation": "modify",
          "description": "Make Flag dialog team button labels strictly derived from the provided scoreboard icons via existing team icon mapping, and align disabled/blocked logic to reflect actual scoreboard presence (avoid treating missing props as a permanent 'teams not selected' state)."
        }
      ]
    }
  ]
}